[
  {
    "q": "What does fe80::/64 represent?",
    "c": [
      "A Link-Local Address",
      "A Site-Local Address",
      "A Multicast Address",
      "An Anycast Address"
    ],
    "a": [
      "A Link-Local Address"
    ],
    "e": "The prefix used for a link-local address is fe80::/64. On a single-link IPv6 network with no router, link-local addresses are used to communicate between devices on the link. Unlike link-local addresses, site-local addresses are not automatically configured and must be assigned through either stateless or stateful address configuration processes. The prefix used for the site-local address is feC0::/10. As with IPv4 addresses, multicasting sends and receives data between groups of nodes. It sends IP messages to a group rather than to every node on the LAN (broadcast) or just one other node (unicast). Anycast addresses represent the middle ground between unicast addresses and multicast addresses. Anycast delivers messages to any one node in the multicast group.",
    "originalIndex": 65,
    "incorrectTries": 1
  },
  {
    "q": "If multiple routes exist for data to travel, which routing table entry will be used?",
    "c": [
      "Metric:",
      "Interface:",
      "Netmask:",
      "Gateway:"
    ],
    "a": [
      "Metric:"
    ],
    "e": "In a routing table, the metric is a measurement of the directness of a route. If multiple routes exist for data to travel, the route with the lowest metric is chosen. The lower the metric, the faster the route. The interface is the address of the interface that’s used to send the packet to the destination. The netmask is the subnet mask value for the destination parameter. The gateway is where the IP address is sent. This may be a gateway server, a router, or another system acting as a gateway.",
    "originalIndex": 49,
    "incorrectTries": 1
  },
  {
    "q": "Which of the following is the optimal range for relative humidity in a datacenter or network installation environment to prevent equipment damage and corrosion?",
    "c": [
      "25–35 Percent",
      "35–45 Percent",
      "45–55 Percent",
      "55–65 Percent"
    ],
    "a": [
      "45–55 Percent"
    ],
    "e": "The 45–55 percent range: maintaining relative humidity within this range helps prevent electrostatic discharge, equipment corrosion, and static electricity buildup, ensuring the reliability and longevity of networking hardware.",
    "originalIndex": 109,
    "incorrectTries": 1
  },
  {
    "q": "In this data center architecture, each server rack has its own dedicated switch, reducing cabling complexity and improving scalability by minimizing latency between devices in the same rack. Which architecture is this?",
    "c": [
      "Collapsed Core",
      "NFV",
      "ToR Switching",
      "Four-Tier Hierarchical Model"
    ],
    "a": [
      "ToR Switching"
    ],
    "e": "Top-of-Rack (ToR) switching places network switches within each server rack, creating a localized network segment. This contrasts with collapsed core architectures that centralize switching functions.",
    "originalIndex": 28,
    "incorrectTries": 1
  },
  {
    "q": "Which layer in the three-tier hierarchical model network architecture facilitates traffic between end devices and the rest of the network?",
    "c": [
      "Core Layer",
      "Distribution Layer",
      "Point-To-Point Layer",
      "Access Layer"
    ],
    "a": [
      "Access Layer"
    ],
    "e": "The access layer in three-tier hierarchical model network architecture facilitates traffic between end devices and the rest of the network, including user data, management traffic, and control messages. The core layer is the backbone of the network, provides high-speed connectivity between distribution layers, and serves as a transit for all traffic. The distribution layer aggregates and filters traffic; enforces security policies; and implements VLANs, routing protocols, and Quality of Service (QoS). Point to point is not a layer in the three-tier hierarchical model. It is a network configuration where two devices or nodes are directly connected to each other. In this topology, there is a dedicated communication link between the two endpoints, and data flows directly between them without the involvement of any intermediary devices.",
    "originalIndex": 31,
    "incorrectTries": 1
  },
  {
    "q": "Which backup methods clear the archive bit after the backup has been completed? (Choose two.)",
    "c": [
      "Full",
      "Differential",
      "Incremental",
      "Gfs"
    ],
    "a": [
      "Full",
      "Incremental"
    ],
    "e": "The archive bit is reset after a full backup and an incremental backup. Answer B is incorrect because the differential backup does not reset the archive bit. Answer D is wrong because GFS is a rotation strategy, not a backup method.",
    "originalIndex": 130,
    "incorrectTries": 1
  },
  {
    "q": "Which of the following is a secure alternative to Telnet that enables secure sessions to be opened on a remote host?",
    "c": [
      "Ssh",
      "Rsh",
      "Ipsec",
      "Rdp"
    ],
    "a": [
      "Ssh"
    ],
    "e": "SSH is a secure alternative to Telnet that enables secure sessions to be opened on a remote host. SSH uses port 22.",
    "originalIndex": 166,
    "incorrectTries": 1
  },
  {
    "q": "This network architecture includes simplicity, cost savings (via a reduced number of network devices and switches), efficient communication (with fewer layers, there are fewer network hops between devices), and scalability (it can scale relatively well for medium-sized networks and datacenters with a moderate number of devices). Which network architecture is being described?",
    "c": [
      "Collapsed Core",
      "NFV",
      "ToR Switching",
      "Four-Tier Hierarchical Model"
    ],
    "a": [
      "Collapsed Core"
    ],
    "e": "With a collapsed core architecture, the three-tier model becomes a two-tier model as the core and distribution layers are combined. By collapsing the core and distribution layers into a single layer, the streamlined design provides both advantages and trade-offs. Advantages include simplicity, cost savings (via a reduced number of network devices and switches), efficient communication (with fewer layers, there are fewer network hops between devices), and scalability (it can scale relatively well for medium-sized networks and datacenters with a moderate number of devices). Network Functions Virtualization (NFV) is a technology that allows for the virtualization of a replica of a network's physical topology and the way it behaves without changing the logical topology and the way that devices are managed. NFV allows for the virtualization of network functions such as routers, firewalls, and switches, resulting in increased flexibility and scalability. When top-of-rack (ToR) switching is incorporated into the network architecture, switches located within the same rack are connected to an in-rack network switch, which is connected to aggregation switches (usually via fiber cabling). There is no such thing as the four-tier hierarchical model.",
    "originalIndex": 30,
    "incorrectTries": 1
  },
  {
    "q": "Which of the following can serve as load balancers?",
    "c": [
      "Ids And Dns Servers",
      "Multilayer Switches And Ips",
      "Multilayer Switches And Dns Servers",
      "Voip Pbxs And Utm Appliances"
    ],
    "a": [
      "Multilayer Switches And Dns Servers"
    ],
    "e": "Multilayer switches and DNS servers can serve as load balancers.",
    "originalIndex": 55,
    "incorrectTries": 1
  },
  {
    "q": "Which of the following best describes the function of the default gateway?",
    "c": [
      "It Converts Hostnames To Ip Addresses.",
      "It Converts Ip Addresses To Hostnames.",
      "It Enables Systems To Communicate With Systems On A Remote Network.",
      "It Enables Systems To Communicate With Routers."
    ],
    "a": [
      "It Enables Systems To Communicate With Systems On A Remote Network."
    ],
    "e": "The default gateway enables the system to communicate with systems on a remote network, without the need for explicit routes to be defined. The default gateway can be assigned automatically using a DHCP server or can be input manually.",
    "originalIndex": 178,
    "incorrectTries": 1
  },
  {
    "q": "What should you do if a weakness is discovered that affects network security and no patch has yet been released?",
    "c": [
      "Post Information About The Weakness On The Vendor’S Site.",
      "Call The Press To Put Pressure On The Vendor.",
      "Ignore The Problem And Wait For The Patch.",
      "Take The At-Risk System Offline."
    ],
    "a": [
      "Take The At-Risk System Offline."
    ],
    "e": "Often, the only thing that you, as a security administrator, can do between the discovery of the exploit and the release of the patch is to turn off the service. Although this approach can be a costly undertaking in terms of productivity, it can be the only way to keep the network safe.",
    "originalIndex": 126,
    "incorrectTries": 1
  },
  {
    "q": "Which of the following devices passes data based on the MAC address?",
    "c": [
      "Hub",
      "Switch",
      "Msau",
      "Router"
    ],
    "a": [
      "Switch"
    ],
    "e": "When determining the destination for a data packet, the switch learns the MAC address of all devices attached to it and then matches the destination MAC address in the data it receives. None of the other devices listed pass data based solely on the MAC address.",
    "originalIndex": 53,
    "incorrectTries": 1
  },
  {
    "q": "Which of the following commands would you use to add a static entry to the ARP table of a Windows system?",
    "c": [
      "Arp -A Ip Address Mac Address",
      "Arp -S Mac Address Ip Address",
      "Arp -S Ip Address Mac Address",
      "Arp -I Ip Address Mac Address"
    ],
    "a": [
      "Arp -S Ip Address Mac Address"
    ],
    "e": "The arp -s IP Address MAC Address command would correctly add a static entry to the ARP table. None of the other answers are valid ARP switches.",
    "originalIndex": 187,
    "incorrectTries": 3
  },
  {
    "q": "Which of the following commands would you use to add a static entry to the ARP table of a Windows system?",
    "c": [
      "Arp -A Ip Address Mac Address",
      "Arp -S Mac Address Ip Address",
      "Arp -S Ip Address Mac Address",
      "Arp -I Ip Address Mac Address"
    ],
    "a": [
      "Arp -S Ip Address Mac Address"
    ],
    "e": "The arp -s IP Address MAC Address command would correctly add a static entry to the ARP table. None of the other answers are valid ARP switches.",
    "originalIndex": 187,
    "incorrectTries": 3
  },
  {
    "q": "Which of the following commands would you use to add a static entry to the ARP table of a Windows system?",
    "c": [
      "Arp -A Ip Address Mac Address",
      "Arp -S Mac Address Ip Address",
      "Arp -S Ip Address Mac Address",
      "Arp -I Ip Address Mac Address"
    ],
    "a": [
      "Arp -S Ip Address Mac Address"
    ],
    "e": "The arp -s IP Address MAC Address command would correctly add a static entry to the ARP table. None of the other answers are valid ARP switches.",
    "originalIndex": 187,
    "incorrectTries": 3
  },
  {
    "q": "Which allows users to create separate copies of the codebase to work on independent features, fixes, or experiments without affecting the main codebase?",
    "c": [
      "Central Repositories",
      "Version Control",
      "Branching",
      "Immutable Infrastructure"
    ],
    "a": [
      "Branching"
    ],
    "e": "Branching allows users to create separate branches or copies of the codebase to work on independent features, fixes, or experiments without affecting the main codebase. Branching is particularly useful in IaC workflows for managing different environments (e.g., development, staging, production) or implementing new features or changes in isolation. IaC encourages the use of central repositories to store and manage infrastructure configurations, providing a centralized location for collaboration, version control, and change management. Central repositories serve as the single source of truth for infrastructure configurations, ensuring that all changes are tracked, documented, and auditable. IaC automation tools typically integrate with version control systems such as Git, allowing infrastructure configurations and automation scripts to be managed and tracked over time. Version Control provides visibility, auditability, and traceability for upgrade activities, ensuring that changes can be managed and tracked effectively. IaC promotes the concept of immutable infrastructure, where infrastructure resources are treated as disposable and are not modified once deployed. Instead of making changes to existing infrastructure, new infrastructure is provisioned from scratch with the desired configuration.",
    "originalIndex": 69,
    "incorrectTries": 1
  },
  {
    "q": "Which of the following OSI layers is responsible for establishing connections between two devices?",
    "c": [
      "Network",
      "Transport",
      "Session",
      "Data Link"
    ],
    "a": [
      "Transport"
    ],
    "e": "The transport layer is responsible for establishing a connection between networked devices. The network layer is most commonly associated with route discovery and datagram delivery. Protocols at the session layer synchronize the data exchange between applications on separate devices. Protocols at the data link layer perform error detection and handling for the transmitted signals and define the method by which the medium is accessed.",
    "originalIndex": 3,
    "incorrectTries": 1
  },
  {
    "q": "You have just used a port scanner for the first time. On one port, it reports that there is not a process listening, and access to this port will likely be denied. Which state is the port most likely considered to be in?",
    "c": [
      "Listening",
      "Closed",
      "Filtered",
      "Blocked"
    ],
    "a": [
      "Closed"
    ],
    "e": "When a port is closed, no process is listening on that port, and access to this port will likely be denied. When the port is open and listening, the host sends a reply indicating that a service is listening on the port. When the port is filtered or blocked, there is no reply from the host, meaning that the port is not listening or the port is secured and filtered.",
    "originalIndex": 123,
    "incorrectTries": 1
  },
  {
    "q": "At which OSI layer does an AP operate?",
    "c": [
      "Network",
      "Physical",
      "Data Link",
      "Session"
    ],
    "a": [
      "Data Link"
    ],
    "e": "A wireless access point (AP) operates at the data link layer of the OSI model. An example of a network layer device is a router. An example of a physical layer device is a hub. Session layer components normally are software, not hardware.",
    "originalIndex": 0,
    "incorrectTries": 1
  },
  {
    "q": "Which of the following ports is no longer assigned by IANA?",
    "c": [
      "49",
      "51",
      "53",
      "59"
    ],
    "a": [
      "51",
      "59"
    ],
    "e": "TACACS+ uses TCP port 49 by default and DNS uses port 53",
    "originalIndex": 148,
    "incorrectTries": 1
  },
  {
    "q": "Which of the following ports is used by TACACS+ by default?",
    "c": [
      "49",
      "51",
      "53",
      "59"
    ],
    "a": [
      "49"
    ],
    "e": "TACACS+ uses TCP port 49 by default.",
    "originalIndex": 147,
    "incorrectTries": 1
  },
  {
    "q": "What does feC0::/10 represent?",
    "c": [
      "A Link-Local Address",
      "A Site-Local Address",
      "A Multicast Address",
      "An Anycast Address"
    ],
    "a": [
      "A Site-Local Address"
    ],
    "e": "The prefix used for the site-local address is feC0::/10. It was formerly used for private addressing but is now deprecated",
    "originalIndex": 67,
    "incorrectTries": 1
  }
]